Pandas

In [1]:
import pandas as pd

In [3]:
s = pd.Series(['Pulkit', 'Nikhil', 'Jigar', 'Sourav'])
print(s)
print(s[0])
print(s[1:4])
print(s[[0,1,3]])

0    Pulkit
1    Nikhil
2     Jigar
3    Sourav
dtype: object
Pulkit
1    Nikhil
2     Jigar
3    Sourav
dtype: object
0    Pulkit
1    Nikhil
3    Sourav
dtype: object

In [4]:
#boolean indexing

param = s != 'Pulkit'
print(s[param])

1    Nikhil
2     Jigar
3    Sourav
dtype: object

In [5]:
d = {'Ludhiana': 100, 'Delhi': 200, 'Mumbai': 300, 'Chandigarh': 400}
cities = pd.Series(d)
print(cities)

Ludhiana      100
Delhi         200
Mumbai        300
Chandigarh    400
dtype: int64

In [6]:
cities[['Delhi','Ludhiana']]

Delhi       200
Ludhiana    100
dtype: int64

In [7]:
#selection
cities[cities<200]

Ludhiana    100
dtype: int64

In [8]:
cities[cities<200] = 500
print(cities)

Ludhiana      500
Delhi         200
Mumbai        300
Chandigarh    400
dtype: int64

In [10]:
#DataFrame
titanic = pd.read_csv('Titanic.txt', sep='\t') #seperated with tabs
titanic.head()

  pclass    age   sex survived
0    1st  adult  male      yes
1    1st  adult  male      yes
2    1st  adult  male      yes
3    1st  adult  male      yes
4    1st  adult  male      yes

In [11]:
titanic['age']

0       adult
1       adult
2       adult
3       adult
4       adult
        ...
2196    adult
2197    adult
2198    adult
2199    adult
2200    adult
Name: age, Length: 2201, dtype: object

In [12]:
titanic[['age','pclass']]

        age pclass
0     adult    1st
1     adult    1st
2     adult    1st
3     adult    1st
4     adult    1st
...     ...    ...
2196  adult   crew
2197  adult   crew
2198  adult   crew
2199  adult   crew
2200  adult   crew

[2201 rows x 2 columns]

In [15]:
titanic[(titanic.age=='child')&(titanic.pclass=='2nd')]

    pclass    age     sex survived
586    2nd  child    male      yes
587    2nd  child    male      yes
588    2nd  child    male      yes
589    2nd  child    male      yes
590    2nd  child    male      yes
591    2nd  child    male      yes
592    2nd  child    male      yes
593    2nd  child    male      yes
594    2nd  child    male      yes
595    2nd  child    male      yes
596    2nd  child    male      yes
597    2nd  child  female      yes
598    2nd  child  female      yes
599    2nd  child  female      yes
600    2nd  child  female      yes
601    2nd  child  female      yes
602    2nd  child  female      yes
603    2nd  child  female      yes
604    2nd  child  female      yes
605    2nd  child  female      yes
606    2nd  child  female      yes
607    2nd  child  female      yes
608    2nd  child  female      yes
609    2nd  child  female      yes

In [16]:
titanic[320:330]

    pclass    age     sex survived
320    1st  child    male      yes
321    1st  child    male      yes
322    1st  child    male      yes
323    1st  child    male      yes
324    1st  child  female      yes
325    2nd  adult    male      yes
326    2nd  adult    male      yes
327    2nd  adult    male      yes
328    2nd  adult    male      yes
329    2nd  adult    male      yes

In [17]:
by_age = titanic.groupby('age')
by_age.size()

age
adult    2092
child     109
dtype: int64

In [18]:
print(titanic.groupby(['sex']).size())

sex
female     470
male      1731
dtype: int64

In [19]:
print(titanic.groupby(['survived','sex']).size())

survived  sex
no        female     126
          male      1364
yes       female     344
          male       367
dtype: int64